InformationRegisters/РеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещенийТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАктаОРасхождениях</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыСборокТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАвансовогоОтчета</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыТаможенныхДеклараций</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыРеализацийТоваровУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннихЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтраженияВУчете</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсправляемыеДокументы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсправляемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсправляемыеДокументы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторноИсправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, оформившее документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПеремещения</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеОтгрузки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнойДокументПодтвержденияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПриемки</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЯндексКассе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОпись</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СводнаяСправкаНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДСНаРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНазначенияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхВозвратах</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураКомиссионеру</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковРасчетовПоЭквайрингу</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковСПодотчетниками</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураКомитента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивовПассивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваровУХранителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительЗаписи</Name>
					<Comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПравилаРаспределенияНаСебестоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПравилаРаспределенияНаСебестоимостьТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноКоличеству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноСебестоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноВесу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъему</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/РаспределениеРасходовНаПоступления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918  
	КР_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	// >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	НаименованиеЕдиницыИзмеренияВеса = Строка(Константы.ЕдиницаИзмеренияВеса.Получить());
	НаименованиеЕдиницыИзмеренияОбъема = Строка(Константы.ЕдиницаИзмеренияОбъема.Получить());
	
	Если Параметры.Свойство("Валюта") Тогда
		Валюта = Параметры.Валюта;
	Иначе
		Валюта = Константы.ВалютаУправленческогоУчета.Получить();
	КонецЕсли;
	
	УстановитьЗаголовкиПолей();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаСтрок") Тогда
		ЗаполнитьРеквизитыДокумента();
	КонецЕсли;
	
	УстановитьПравилоРаспределения();
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		ЭтаФорма.Заголовок = НСтр("ru = 'Распределение расходов на себестоимость товаров'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьОстатокКРаспределению();
	РассчитатьИтоговыеСуммы();
	ПроверитьЗаполнениеКоэффициентов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриИзменении(Элемент)
	ПересчитатьОстатокКРаспределению();
	РассчитатьИтоговыеСуммы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	ПроверитьЗаполнениеКоэффициентов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовДокументПриИзменении(Элемент)
	Результат = ЗаполнитьИнформационныеПоля(Элементы.СписокДокументов.ТекущиеДанные.АналитикаРасходов);
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(Элементы.СписокДокументов.ТекущиеДанные, Результат);
		
		СтрокаТЧ = Элементы.СписокДокументов.ТекущиеДанные;
		СтрокаТЧ.Количество = Количество;
		СтрокаТЧ.Содержание = Содержание;
		СтрокаТЧ.СтавкаНДС = СтавкаНДС;
		СтрокаТЧ.Подразделение = Подразделение;
		СтрокаТЧ.СтатьяРасходов = СтатьяРасходов;
		
		ПересчитатьОстатокКРаспределению();
		РассчитатьИтоговыеСуммы();
		ПроверитьЗаполнениеКоэффициентов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если ОсталосьРаспределить <> 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Необходимо дораспределить на документы поступления'") + " " + ОсталосьРаспределить + " " + Валюта;
		Сообщение.Сообщить();
	Иначе
		Закрыть(ПоместитьРезультатВоВременноеХранилище());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБазуРаспределения(Команда)
	МассивДокументов = Новый СписокЗначений();
	Для Каждого ТекСтрока Из СписокДокументов Цикл
		МассивДокументов.Добавить(ТекСтрока.АналитикаРасходов);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("МассивДокументов", МассивДокументов));
	ПараметрыОткрытия.Вставить("КлючВарианта", "ПоступленияСоСтрокамиКонтекстный");
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.РасшифровкаПоступленийПоНоменклатуре.Форма", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНезаполненныеСтроки(Команда)
	МассивДокументов = Новый СписокЗначений();
	Для Каждого ТекСтрока Из СписокДокументов Цикл
		МассивДокументов.Добавить(ТекСтрока.АналитикаРасходов);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("МассивДокументов", МассивДокументов));
	ПараметрыОткрытия.Вставить("КлючВарианта", "НезаполненныеВесОбъемВПоступленияхКонтекстный");
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.РасшифровкаПоступленийПоНоменклатуре.Форма", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"ОбщаяФорма.РаспределениеРасходовНаПоступления.Команда.Распределить");
	
	Если ПравилоРаспределения = "ПоКоличеству" Тогда
		Итог = ИтогоКоличество;
		ИмяКоэффициента = "КоэффициентКоличество";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально количеству накладной'");
	ИначеЕсли ПравилоРаспределения = "ПоВесу" Тогда
		Итог = ИтогоВес;
		ИмяКоэффициента = "КоэффициентВес";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально весу накладной'");
	ИначеЕсли ПравилоРаспределения = "ПоОбъему" Тогда
		Итог = ИтогоОбъем;
		ИмяКоэффициента = "КоэффициентОбъем";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально объему накладной'");
	Иначе
		Итог = ИтогоСумма;
		ИмяКоэффициента = "КоэффициентСумма";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально сумме накладной'");
	КонецЕсли;
	
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%РаспределенаСумма%", СуммаКРаспределению);
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%Валюта%", Валюта);
	КоличествоСтрок = СписокДокументов.Количество();
	Если КоличествоСтрок = 1 Тогда
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строку ";
	ИначеЕсли КоличествоСтрок > 1 И КоличествоСтрок < 5 Тогда
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строки ";
	Иначе
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строк ";
	КонецЕсли;
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%КоличествоСтрок%", ТекстКоличествоСтрок);
	
	КРаспределению = СуммаКРаспределению;
	Для Каждого Строка Из СписокДокументов Цикл
		Если Итог * Строка[ИмяКоэффициента] = 0 Тогда
			Списать = 0;
		Иначе
			Списать = Окр(СуммаКРаспределению / Итог * Строка[ИмяКоэффициента], 2, РежимОкругления.Окр15как20);
		КонецЕсли;
		Строка.КомментарийРаспределения = КомментарийРаспределения;
		Если Списать > КРаспределению Тогда
			Строка.Сумма = КРаспределению;
			КРаспределению = 0;
			Прервать;
		Иначе
			Строка.Сумма = Списать;
			КРаспределению = КРаспределению - Списать;
		КонецЕсли;
	КонецЦикла;
	Если КРаспределению <> 0
		И КРаспределению <> СуммаКРаспределению 
	Тогда
		Строка.Сумма = Строка.Сумма + КРаспределению;
	КонецЕсли;
	
	ПересчитатьОстатокКРаспределению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовкиПолей()

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Валюта",
				"Заголовок", Валюта);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаНеРаспределено",
				"Заголовок", Валюта);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовСумма",
				"Заголовок", НСтр("ru='Сумма'") +" (" + ВалютаУпр + ")");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовВес",
				"Заголовок", НСтр("ru='Вес'") +" (" + НаименованиеЕдиницыИзмеренияВеса + ")");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовОбъем",
				"Заголовок", НСтр("ru='Объем'") +" (" + НаименованиеЕдиницыИзмеренияОбъема + ")");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокумента()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	Строки.АналитикаРасходов КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВтМассивСтрок
	|ИЗ
	|	&МассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.АналитикаРасходов) 
	|		= ТИП(Документ.ПриобретениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	Строки.Ссылка            КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ МассивСтрок
	|ИЗ
	|	ВтМассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.Ссылка) 
	|		= ТИП(Документ.ПриобретениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Строки.Сумма) КАК Сумма
	|ИЗ
	|	МассивСтрок КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ СодержаниеРасходов
	|ИЗ
	|	МассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Содержание <> НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	СодержаниеРасходов КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента
	|ИЗ ВтМассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Ссылка = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента                     КАК НомерСтрокиДокумента,
	|	Себестоимость.Регистратор                       КАК АналитикаРасходов,
	|	Себестоимость.Организация                       КАК Организация,
	|	Себестоимость.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	Текст.Содержание                                КАК Содержание,
	|	Текст.Количество                                КАК Количество,
	|	Текст.СтавкаНДС                                 КАК СтавкаНДС,
	|	Текст.Подразделение                             КАК Подразделение,
	|	Текст.СтатьяРасходов                            КАК СтатьяРасходов,
	|	СУММА(Себестоимость.Количество)                 КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)                  КАК КоэффициентСумма,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаВесУпаковки)   	  КАК КоэффициентВес,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаОбъемУпаковки) 	  КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	МассивСтрок КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО Строки.Ссылка = Себестоимость.Регистратор
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ СодержаниеРасходов КАК Текст
	|		ПО ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.НомерСтрокиДокумента,
	|	Себестоимость.Регистратор,
	|	Себестоимость.Период,
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаПоПартнерам.Партнер,
	|	Текст.Содержание,
	|	Текст.Количество,
	|	Текст.СтавкаНДС,
	|	Текст.Подразделение,
	|	Текст.СтатьяРасходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДокумента
	|";
	
	// << 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	СтрокаЗамены = "ВЫРАЗИТЬ(Себестоимость.Регистратор КАК Документ.ПриобретениеТоваровУслуг).КР_ВесБруттоДокумента";
	ТекстОшибки = НСтр("ru = 'Исходный текст запроса был изменен. Не найдена строка замены.'");
	
	ИскомаяСтрока = "СУММА(Себестоимость.Количество * &ТекстЗапросаВесУпаковки)";
	Если СтрНайти(ТекстЗапроса, ИскомаяСтрока) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИскомаяСтрока, СтрокаЗамены);
	Иначе
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИскомаяСтрока = "&ТекстЗапросаВесУпаковки";
	Если СтрНайти(ТекстЗапроса, ИскомаяСтрока) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИскомаяСтрока, СтрокаЗамены);
	Иначе
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	// >> 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаВесУпаковки",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаОбъемУпаковки",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивСтрок", ПолучитьИзВременногоХранилища(Параметры.ТаблицаСтрок));
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	Выборка.Следующий();
	СуммаКРаспределению = Выборка.Сумма;
	
	Выборка = Результат[4].Выбрать();
	Выборка.Следующий();
	
	Содержание = Выборка.Содержание;
	Количество = Выборка.Количество;
	СтавкаНДС = Выборка.СтавкаНДС;
	Подразделение = Выборка.Подразделение;
	СтатьяРасходов = Выборка.СтатьяРасходов;
	
	СтрокиКУдалению.Загрузить(Результат[5].Выгрузить());
	СписокДокументов.Загрузить(Результат[6].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПравилоРаспределения() 
	ПравилоРаспределенияВСтатье = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов, "ПравилоРаспределенияНаСебестоимость");
	Если ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноКоличеству
		ИЛИ ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПустаяСсылка()
	Тогда
		ПравилоРаспределения = "ПоКоличеству";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноСебестоимости Тогда
		ПравилоРаспределения = "ПоСумме";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноВесу Тогда
		ПравилоРаспределения = "ПоВесу";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноОбъему Тогда
		ПравилоРаспределения = "ПоОбъему";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговыеСуммы()
	ИтогоСумма = СписокДокументов.Итог("КоэффициентСумма");
	ИтогоКоличество = СписокДокументов.Итог("КоэффициентКоличество");
	ИтогоВес = СписокДокументов.Итог("КоэффициентВес");
	ИтогоОбъем = СписокДокументов.Итог("КоэффициентОбъем");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОстатокКРаспределению()
	ОсталосьРаспределить = СуммаКРаспределению - СписокДокументов.Итог("Сумма")
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатВоВременноеХранилище()

	ВыгружаемыеПоля = "
	|НомерСтрокиДокумента, 
	|Сумма,
	|Содержание,
	|КомментарийРаспределения,
	|Количество,
	|СтавкаНДС,
	|Подразделение,
	|АналитикаРасходов,
	// << 19.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|КР_СтатьяРасходовБазовая,
	|КР_Коллекция,
	// >> 19.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|СтатьяРасходов
	|";
	ПараметрыЗакрытия = Новый Структура("АдресВоВременномХранилище, СтрокиКУдалению",
						ПоместитьВоВременноеХранилище(СписокДокументов.Выгрузить(,ВыгружаемыеПоля), АдресВоВременномХранилище),
						ПоместитьВоВременноеХранилище(СтрокиКУдалению.Выгрузить(,"НомерСтрокиДокумента"), АдресСтрокКУдалению));
	Возврат ПараметрыЗакрытия;

КонецФункции

&НаСервере
Функция ЗаполнитьИнформационныеПоля(Данные)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Реестр.Партнер, НЕОПРЕДЕЛЕНО) КАК Партнер,   
	|	СУММА(Себестоимость.Количество) КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)  КАК КоэффициентСумма,
	|	СУММА(Себестоимость.Количество
	|		* ЕСТЬNULL(&ТекстЗапросаВесУпаковки, 0)
	|	)                               КАК КоэффициентВес,
	|	СУММА(Себестоимость.Количество 
	|		* ЕСТЬNULL(&ТекстЗапросаОбъемУпаковки, 0)
	|	)                               КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                          КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                          КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = Себестоимость.Регистратор
	|		И Реестр.Организация = Себестоимость.Организация
	|		И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	Себестоимость.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	|	ЕСТЬNULL(Реестр.Партнер, НЕОПРЕДЕЛЕНО)
	|";
	
	// << 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	СтрокаЗамены = "ВЫРАЗИТЬ(Себестоимость.Регистратор КАК Документ.ПриобретениеТоваровУслуг).КР_ВесБруттоДокумента";
	ТекстОшибки = НСтр("ru = 'Исходный текст запроса был изменен. Не найдена строка замены.'");
	
	ИскомаяСтрока =
		"СУММА(Себестоимость.Количество
		|		* ЕСТЬNULL(&ТекстЗапросаВесУпаковки, 0)
		|	)";
	Если СтрНайти(ТекстЗапроса, ИскомаяСтрока) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИскомаяСтрока, СтрокаЗамены);
	Иначе
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИскомаяСтрока = "&ТекстЗапросаВесУпаковки";
	Если СтрНайти(ТекстЗапроса, ИскомаяСтрока) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИскомаяСтрока, СтрокаЗамены);
	Иначе
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	// >> 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаВесУпаковки", 
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаОбъемУпаковки", 
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Ссылка", Данные);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() <> 0 Тогда
		СтрокаРезультата = Новый Структура("Партнер,
		|КоэффициентКоличество,
		|КоэффициентСумма,
		|КоэффициентВес,
		|КоэффициентОбъем,
		|ОшибкаКоэффициентВес,
		|ОшибкаКоэффициентОбъем
		|");
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, Результат[0]);
	Иначе
		СтрокаРезультата = Неопределено;
	КонецЕсли;
	
	Возврат СтрокаРезультата;

КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеКоэффициентов()
	Если СписокДокументов.Количество() = 0 Тогда
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Если ПравилоРаспределения = "ПоКоличеству" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("КоэффициентКоличество") = 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
	ИначеЕсли ПравилоРаспределения = "ПоВесу" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("ОшибкаКоэффициентВес") <> 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Истина;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
		Элементы.ПредупреждениеДекорацияТекст.Заголовок = НСтр("ru='В документах поступления есть строки с незаполненным весом. Распределение не будет произведено на данные строки.'");
	ИначеЕсли ПравилоРаспределения = "ПоОбъему" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("ОшибкаКоэффициентОбъем") <> 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Истина;
		Элементы.ПредупреждениеДекорацияТекст.Заголовок = НСтр("ru='В документах поступления есть строки с незаполненным объемом. Распределение не будет произведено на данные строки.'");
	ИначеЕсли ПравилоРаспределения = "ПоСумме" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("КоэффициентКоличество") = 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаПредупреждение.Видимость = ЕстьОшибки;
КонецПроцедуры

#КонецОбласти        

#Область КР_ДобавленныеПроцедурыИФункции

// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
&НаСервере
Процедура КР_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	// КР_ДетализироватьДоКоллекций
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_ДетализироватьДоКоллекций", Новый ОписаниеТипов("Булево"));     
	Параметры.Свойство("КР_ДетализироватьДоКоллекций", ЭтотОбъект.КР_ДетализироватьДоКоллекций);
	ДетализироватьДоКоллекций = ЭтотОбъект.КР_ДетализироватьДоКоллекций;
	
	// СписокДокументов.КР_Коллекция
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_Коллекция", Новый ОписаниеТипов("СправочникСсылка.КоллекцииНоменклатуры"), "СписокДокументов",
		НСтр("ru = 'Коллекция'"));     
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		РеквизитФормы, , Элементы.СписокДокументовПартнер);
	ЭлементФормы.Видимость = ДетализироватьДоКоллекций;                  
	
	// СписокДокументов.КР_СтатьяРасходовБазовая
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_СтатьяРасходовБазовая", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"), "СписокДокументов");     
	
	Если ДетализироватьДоКоллекций Тогда  
		УстановитьДействие("ОбработкаВыбора", "КР_ОбработкаВыбора");
		Элементы.СписокДокументов.УстановитьДействие("ПередНачаломДобавления", "КР_СписокДокументовПередНачаломДобавления");
		Элементы.СписокДокументовПартнер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918

// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
&НаКлиенте
Процедура КР_СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	// Выполняется только если КР_ДетализироватьДоКоллекций = Истина                                        
	
	Отказ = Истина;
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.ФормаВыбора", , ЭтотОбъект, , , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918

// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
&НаКлиенте
Процедура КР_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	КР_ЗаполнитьДетализациейПоКоллекциям(ВыбранноеЗначение);

	ПересчитатьОстатокКРаспределению();
	РассчитатьИтоговыеСуммы();
	ПроверитьЗаполнениеКоэффициентов();
	
КонецПроцедуры // >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918

// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
&НаСервере
Процедура КР_ЗаполнитьДетализациейПоКоллекциям(ПриобретениеТоваровУслуг)  
	
	// Вес брутто учитывается не верно. не прописанно в ФДР
	ТекстЗапроса = КР_ТекстЗапросаДетализацияПриобретенияПоКоллекциям();

	// << 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	//							"&ТекстЗапросаВесУпаковки", 
	//							Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	//								"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
	//								"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	СтрокаЗамены = "ВЫРАЗИТЬ(Себестоимость.Регистратор КАК Документ.ПриобретениеТоваровУслуг).КР_ВесБруттоДокумента";
	ТекстОшибки = НСтр("ru = 'Исходный текст запроса был изменен. Не найдена строка замены.'");
		
	ИскомаяСтрока = "&ТекстЗапросаВесУпаковки";
	Если СтрНайти(ТекстЗапроса, ИскомаяСтрока) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИскомаяСтрока, СтрокаЗамены);
	Иначе
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	// >> 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаОбъемУпаковки", 
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПриобретениеТоваровУслуг);
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		НоваяСтрока = СписокДокументов.Добавить();    
		НоваяСтрока.АналитикаРасходов = ПриобретениеТоваровУслуг;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);  
		
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.Содержание = Содержание;
		НоваяСтрока.СтавкаНДС = СтавкаНДС;
		НоваяСтрока.Подразделение = Подразделение;
		НоваяСтрока.КР_СтатьяРасходовБазовая = СтатьяРасходов;
		НоваяСтрока.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.КР_ПолучитьСтатьюРасходовКоллекции(
			СтатьяРасходов, НоваяСтрока.КР_Коллекция);
		
	КонецЦикла;	
	
КонецПроцедуры // >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
		
#Область ТекстыЗапросов

// << 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
&НаСервере
Функция КР_ТекстЗапросаДетализацияПриобретенияПоКоллекциям()
	
	Возврат
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Реестр.Партнер, НЕОПРЕДЕЛЕНО) КАК Партнер,   
	// << 16.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.КоллекцияНоменклатуры КАК КР_Коллекция,
	// >> 16.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|	СУММА(Себестоимость.Количество) КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)  КАК КоэффициентСумма,   
	// << 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	//|	СУММА(Себестоимость.Количество
	//|		* ЕСТЬNULL(&ТекстЗапросаВесУпаковки, 0)
	//|	)                               КАК КоэффициентВес, 
	|	ВЫРАЗИТЬ(Себестоимость.Регистратор 
	|		КАК Документ.ПриобретениеТоваровУслуг).КР_ВесБруттоДокумента КАК КоэффициентВес,
	// >> 15.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-742
	|	СУММА(Себестоимость.Количество 
	|		* ЕСТЬNULL(&ТекстЗапросаОбъемУпаковки, 0)
	|	)                               КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                          КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                          КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = Себестоимость.Регистратор
	|		И Реестр.Организация = Себестоимость.Организация
	|		И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	Себестоимость.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	// << 16.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.КоллекцияНоменклатуры,
	// >> 16.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	|	ЕСТЬNULL(Реестр.Партнер, НЕОПРЕДЕЛЕНО)
	|";

КонецФункции // >> 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918 

#КонецОбласти

#КонецОбласти
